<a href="https://colab.research.google.com/github/KirtiRanjan26/Pandas-Tutorial/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Why use Pandas?
Handles large datasets easily compared to Excel.

Convenient syntax for filtering, grouping, and transforming data.

Works well with CSV, Excel, SQL databases, JSON, and more.

Built on top of NumPy, so it’s fast and integrates with other data science libraries.

In [4]:
import pandas as pd

In [2]:
# series :-1D labeled array (like a single Excel column).
s = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
print(s)

a    10
b    20
c    30
dtype: int64

### Dataframe

In [8]:
# create empty dataframe
import pandas as pd
df = pd.DataFrame()
print(df)
# create dataframe from list
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print(df)
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'])
print(df)

Empty DataFrame
Columns: []
Index: []
   0
0  1
1  2
2  3
3  4
4  5
     Name  Age
0    Alex   10
1     Bob   12
2  Clarke   13

In [15]:
# create a dataframe from Dictionary
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df = pd.DataFrame(data)
print(df)
# remove default index
print(df.to_string(index= False))
#

    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42
 Name  Age
  Tom   28
 Jack   34
Steve   29
Ricky   42

In [16]:
# dataframe from series
import pandas as pd

data = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(data)
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [20]:
# read csv file
df=pd.read_csv('/content/sample_data/california_housing_test.csv')
print(df)

      longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
0       -122.05     37.37                27.0       3885.0           661.0
1       -118.30     34.26                43.0       1510.0           310.0
2       -117.81     33.78                27.0       3589.0           507.0
3       -118.36     33.82                28.0         67.0            15.0
4       -119.67     36.33                19.0       1241.0           244.0
...         ...       ...                 ...          ...             ...
2995    -119.86     34.42                23.0       1450.0           642.0
2996    -118.14     34.06                27.0       5257.0          1082.0
2997    -119.70     36.30                10.0        956.0           201.0
2998    -117.12     34.10                40.0         96.0            14.0
2999    -119.63     34.42                42.0       1765.0           263.0

      population  households  median_income  median_house_value
0         1537.0       606.0         6.6085            344700.0
1          809.0       277.0         3.5990            176500.0
2         1484.0       495.0         5.7934            270500.0
3           49.0        11.0         6.1359            330000.0
4          850.0       237.0         2.9375             81700.0
...          ...         ...            ...                 ...
2995      1258.0       607.0         1.1790            225000.0
2996      3496.0      1036.0         3.3906            237200.0
2997       693.0       220.0         2.2895             62000.0
2998        46.0        14.0         3.2708            162500.0
2999       753.0       260.0         8.5608            500001.0

[3000 rows x 9 columns]

In [22]:
# save data as csv file
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
df=pd.DataFrame(data)
print(df.to_csv('new.csv',index=False))
df=pd.read_csv('/content/new.csv')
print(df)

None
    Name  Age
0    Tom   28
1   Jack   34
2  Steve   29
3  Ricky   42

### Accessing the DataFrame

In [2]:
import pandas as pd

# Create a DataFrame
data={
    'Name': ['Steve', 'Lia', 'Vin', 'Katie'],
    'Age': [32, 28, 45, 38],
    'Gender': ['Male', 'Female', 'Male', 'Female'],
    'Rating': [3.45, 4.6, 3.9, 2.78]}
df=pd.DataFrame(data,index=['r1','r2','r3','r4'])
print(df)

# Access the rows of the DataFrame
result = df.index
print('Output Accessed Row Labels:', result)
df.index = [100, 200, 300, 400]
print('Output Modified DataFrame with the updated index labels:\n', df)

     Name  Age  Gender  Rating
r1  Steve   32    Male    3.45
r2    Lia   28  Female    4.60
r3    Vin   45    Male    3.90
r4  Katie   38  Female    2.78
Output Accessed Row Labels: Index(['r1', 'r2', 'r3', 'r4'], dtype='object')
Output Modified DataFrame with the updated index labels:
       Name  Age  Gender  Rating
100  Steve   32    Male    3.45
200    Lia   28  Female    4.60
300    Vin   45    Male    3.90
400  Katie   38  Female    2.78

In [6]:
print(df['Name']) # simple way to access single column

100    Steve
200      Lia
300      Vin
400    Katie
Name: Name, dtype: object

In [16]:
# Use loc if you know the labels.
df
#df.loc[['index or label name'],['column name']]
print("print single value:\n",df.loc[200,'Name'])   # Single value → 50
print("print multivalue serialwise\n",df.loc[100:300, 'Name'])    # Slice by labels
print("print multiplevalue in any position\n",df.loc[[100, 400], ['Rating','Name']])  # Multiple rows & columns
print("print easy syntex for single or multiple value\n",df.loc[[200],['Name']])

print single value:
 Lia
print multivalue serialwise
 100    Steve
200      Lia
300      Vin
Name: Name, dtype: object
print multiplevalue in any position
      Rating   Name
100    3.45  Steve
400    2.78  Katie
print easy syntex for single or multiple value
     Name
200  Lia

In [17]:
# Use iloc if you know the integer positions.
print(df.iloc[[0,3],[0,2,3]])
print(df.iloc[0:3,1]) # serial wise row and single column
print(df.iloc[0:3,[0,3]]) #serial wise row and single column
print(df.iloc[0:3,0:2]) # serial wise row and column

      Name  Gender  Rating
100  Steve    Male    3.45
400  Katie  Female    2.78
100    32
200    28
300    45
Name: Age, dtype: int64
      Name  Rating
100  Steve    3.45
200    Lia    4.60
300    Vin    3.90
      Name  Age
100  Steve   32
200    Lia   28
300    Vin   45

In [19]:
# Use at for one value by label (fast).
print(df.at[300, 'Name'])

# Use iat for one value by position (fast).
print(df.iat[1, 1])

Vin
28

In [26]:

import pandas as pd

# Create a DataFrame
data={
    'Name': ['Steve', 'Lia', 'Vin', 'Katie'],
    'Age': [32, 28, 45, 38],
    'Gender': ['Male', 'Female', 'Male', 'Female'],
    'Rating': [3.45, 4.6, 3.9, 2.78]}
df=pd.DataFrame(data,index=['r1','r2','r3','r4'])
print(df);
print(df.info())
# adding new row and new column

     Name  Age  Gender  Rating
r1  Steve   32    Male    3.45
r2    Lia   28  Female    4.60
r3    Vin   45    Male    3.90
r4  Katie   38  Female    2.78
<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, r1 to r4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Gender  4 non-null      object
 3   Rating  4 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 160.0+ bytes
None

In [22]:
df=pd.read_csv('/content/sample_data/california_housing_test.csv')
print(df.head())
print(df.tail())

   longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
0    -122.05     37.37                27.0       3885.0           661.0
1    -118.30     34.26                43.0       1510.0           310.0
2    -117.81     33.78                27.0       3589.0           507.0
3    -118.36     33.82                28.0         67.0            15.0
4    -119.67     36.33                19.0       1241.0           244.0

   population  households  median_income  median_house_value
0      1537.0       606.0         6.6085            344700.0
1       809.0       277.0         3.5990            176500.0
2      1484.0       495.0         5.7934            270500.0
3        49.0        11.0         6.1359            330000.0
4       850.0       237.0         2.9375             81700.0
      longitude  latitude  housing_median_age  total_rooms  total_bedrooms  \
2995    -119.86     34.42                23.0       1450.0           642.0
2996    -118.14     34.06                27.0       5257.0          1082.0
2997    -119.70     36.30                10.0        956.0           201.0
2998    -117.12     34.10                40.0         96.0            14.0
2999    -119.63     34.42                42.0       1765.0           263.0

      population  households  median_income  median_house_value
2995      1258.0       607.0         1.1790            225000.0
2996      3496.0      1036.0         3.3906            237200.0
2997       693.0       220.0         2.2895             62000.0
2998        46.0        14.0         3.2708            162500.0
2999       753.0       260.0         8.5608            500001.0

In [25]:
print(df.isna().sum().sum())

0

In [6]:
df=pd.read_csv('/large_missing_values.csv')
print(df)

    ID   Name   Age  Salary Department
0    1    NaN  30.0  5000.0    Finance
1    2  Ricky  40.0  4000.0         HR
2    3   Emma   NaN  5000.0  Marketing
3    4    NaN  25.0  3000.0         IT
4    5  Steve  40.0  3500.0  Marketing
5    6   Emma  30.0  4500.0         IT
6    7   Emma   NaN  3000.0         IT
7    8    NaN  40.0  4500.0  Marketing
8    9   Jack  25.0     NaN        NaN
9   10  Steve  25.0  3500.0         IT
10  11    NaN  35.0  3500.0         IT
11  12  Steve  35.0  3000.0  Marketing
12  13  Steve  30.0  3500.0         IT
13  14   Emma  40.0  5000.0         IT
14  15  Ricky  40.0  3500.0  Marketing
15  16  Steve  35.0  4500.0  Marketing
16  17   Lily  40.0  4500.0         HR
17  18   Emma  40.0  4500.0        NaN
18  19   Jack  25.0  4500.0        NaN
19  20  Ricky  35.0  5000.0         IT

In [7]:
print(df.describe())# statistical summary

             ID        Age       Salary
count  20.00000  18.000000    19.000000
mean   10.50000  33.888889  4078.947368
std     5.91608   6.076850   731.496903
min     1.00000  25.000000  3000.000000
25%     5.75000  30.000000  3500.000000
50%    10.50000  35.000000  4500.000000
75%    15.25000  40.000000  4500.000000
max    20.00000  40.000000  5000.000000

In [29]:
# finding missing value
print(df.isnull())

       ID   Name    Age  Salary  Department
0   False   True  False   False       False
1   False  False  False   False       False
2   False  False   True   False       False
3   False   True  False   False       False
4   False  False  False   False       False
5   False  False  False   False       False
6   False  False   True   False       False
7   False   True  False   False       False
8   False  False  False    True        True
9   False  False  False   False       False
10  False   True  False   False       False
11  False  False  False   False       False
12  False  False  False   False       False
13  False  False  False   False       False
14  False  False  False   False       False
15  False  False  False   False       False
16  False  False  False   False       False
17  False  False  False   False        True
18  False  False  False   False        True
19  False  False  False   False       False

In [34]:
print(df.isnull().any()) # column wise
print(" total missing value entire dataset",df.isnull().any().any()) # entire dataframe

ID            False
Name           True
Age            True
Salary         True
Department     True
dtype: bool
 total missing value entire dataset True

In [8]:
print(df.isnull().sum())

ID            0
Name          4
Age           2
Salary        1
Department    3
dtype: int64

In [10]:
df['Name']=df['Name'].fillna('Unknown') # without inplace modify data not change permanently in dataset
print(df)

    ID     Name   Age  Salary Department
0    1  Unknown  30.0  5000.0    Finance
1    2    Ricky  40.0  4000.0         HR
2    3     Emma   NaN  5000.0  Marketing
3    4  Unknown  25.0  3000.0         IT
4    5    Steve  40.0  3500.0  Marketing
5    6     Emma  30.0  4500.0         IT
6    7     Emma   NaN  3000.0         IT
7    8  Unknown  40.0  4500.0  Marketing
8    9     Jack  25.0     NaN        NaN
9   10    Steve  25.0  3500.0         IT
10  11  Unknown  35.0  3500.0         IT
11  12    Steve  35.0  3000.0  Marketing
12  13    Steve  30.0  3500.0         IT
13  14     Emma  40.0  5000.0         IT
14  15    Ricky  40.0  3500.0  Marketing
15  16    Steve  35.0  4500.0  Marketing
16  17     Lily  40.0  4500.0         HR
17  18     Emma  40.0  4500.0        NaN
18  19     Jack  25.0  4500.0        NaN
19  20    Ricky  35.0  5000.0         IT

In [20]:
df=pd.read_csv('/large_missing_values.csv')
print(df)

    ID   Name   Age  Salary Department
0    1    NaN  30.0  5000.0    Finance
1    2  Ricky  40.0  4000.0         HR
2    3   Emma   NaN  5000.0  Marketing
3    4    NaN  25.0  3000.0         IT
4    5  Steve  40.0  3500.0  Marketing
5    6   Emma  30.0  4500.0         IT
6    7   Emma   NaN  3000.0         IT
7    8    NaN  40.0  4500.0  Marketing
8    9   Jack  25.0     NaN        NaN
9   10  Steve  25.0  3500.0         IT
10  11    NaN  35.0  3500.0         IT
11  12  Steve  35.0  3000.0  Marketing
12  13  Steve  30.0  3500.0         IT
13  14   Emma  40.0  5000.0         IT
14  15  Ricky  40.0  3500.0  Marketing
15  16  Steve  35.0  4500.0  Marketing
16  17   Lily  40.0  4500.0         HR
17  18   Emma  40.0  4500.0        NaN
18  19   Jack  25.0  4500.0        NaN
19  20  Ricky  35.0  5000.0         IT

In [21]:
df['Name']=df['Name'].fillna('Unknown')
print(df)

    ID     Name   Age  Salary Department
0    1  Unknown  30.0  5000.0    Finance
1    2    Ricky  40.0  4000.0         HR
2    3     Emma   NaN  5000.0  Marketing
3    4  Unknown  25.0  3000.0         IT
4    5    Steve  40.0  3500.0  Marketing
5    6     Emma  30.0  4500.0         IT
6    7     Emma   NaN  3000.0         IT
7    8  Unknown  40.0  4500.0  Marketing
8    9     Jack  25.0     NaN        NaN
9   10    Steve  25.0  3500.0         IT
10  11  Unknown  35.0  3500.0         IT
11  12    Steve  35.0  3000.0  Marketing
12  13    Steve  30.0  3500.0         IT
13  14     Emma  40.0  5000.0         IT
14  15    Ricky  40.0  3500.0  Marketing
15  16    Steve  35.0  4500.0  Marketing
16  17     Lily  40.0  4500.0         HR
17  18     Emma  40.0  4500.0        NaN
18  19     Jack  25.0  4500.0        NaN
19  20    Ricky  35.0  5000.0         IT

In [24]:
df['mean_Age']= df['Age'].fillna(df['Age'].mean())
print(df)

    ID     Name   Age  Salary Department   mean_Age
0    1  Unknown  30.0  5000.0    Finance  30.000000
1    2    Ricky  40.0  4000.0         HR  40.000000
2    3     Emma   NaN  5000.0  Marketing  33.888889
3    4  Unknown  25.0  3000.0         IT  25.000000
4    5    Steve  40.0  3500.0  Marketing  40.000000
5    6     Emma  30.0  4500.0         IT  30.000000
6    7     Emma   NaN  3000.0         IT  33.888889
7    8  Unknown  40.0  4500.0  Marketing  40.000000
8    9     Jack  25.0     NaN        NaN  25.000000
9   10    Steve  25.0  3500.0         IT  25.000000
10  11  Unknown  35.0  3500.0         IT  35.000000
11  12    Steve  35.0  3000.0  Marketing  35.000000
12  13    Steve  30.0  3500.0         IT  30.000000
13  14     Emma  40.0  5000.0         IT  40.000000
14  15    Ricky  40.0  3500.0  Marketing  40.000000
15  16    Steve  35.0  4500.0  Marketing  35.000000
16  17     Lily  40.0  4500.0         HR  40.000000
17  18     Emma  40.0  4500.0        NaN  40.000000
18  19     Jack  25.0  4500.0        NaN  25.000000
19  20    Ricky  35.0  5000.0         IT  35.000000